*** Settings ***
Documentation    Test cases for Budget Request Functionality
Resource    ../resources/config.robot
Resource    ../resources/testdata.robot
Resource    ../keywords/Login_keywords.robot
Resource    ../keywords/Bg_step1_request_reason.robot
Resource    ../keywords/Bg_step2_general_info.robot
Resource    ../keywords/Bg_step3_operation_plan.robot
Resource    ../keywords/Bg_step4_project_readiness.robot
Resource    ../keywords/Bg_step5_project_status.robot
Resource    ../keywords/Budget_PROV_keywords.robot
Resource    ../keywords/Budget_ProvApp_keywords.robot
Resource    ../keywords/VerifySave.robot
Library     SeleniumLibrary
Suite Setup       เปิดเบราว์เซอร์และล็อกอินส่วนราชการ
Suite Teardown    Close Browser

*** Keywords ***
เปิดเบราว์เซอร์และล็อกอินส่วนราชการ
    Open Browser    ${LOGIN_URL}    chrome
    Maximize Browser Window
    ล็อคอินถูกต้อง    ${ORGPROV_USERNAME}    ${ORGPROV_PASSWORD}
    Wait Until Page Contains    หน้าแรก   

กรอกข้อมูลแบบคำขอตามประเภทและการบันทึก
    [Arguments]    ${expense_type}    ${action}    

กรอกข้อมูลแบบคำขอตามประเภทและการยืนยัน
    [Arguments]    ${expense_type}    ${action}
  
    เข้าเมนูข้อมูลแบบคำขอ

    FOR    ${index}    IN RANGE    1
        กดปุ่มเพิ่มข้อมูลแบบคำขอ

        กรอกข้อมูลtab1ส่วนที่1:ข้อมูล
        กรอกข้อมูลtab1ส่วนที่2:ข้อมูลผู้รับผิดชอบ
        กรอกข้อมูลtab1ส่วนที่3:หลักการและเหตุผล
        กรอกข้อมูลtab1ส่วนที่4:สรุปสาระสำคัญ
        กดปุ่มถัดไปเพื่อบันทึกข้อมูลtab1

        กรอกข้อมูลtab2ส่วนที่1:ข้อมูลทั่วไปของโครงการ
        กรอกข้อมูลtab2ส่วนที่2:สถานที่ดำเนินโครงการ
        กรอกข้อมูลtab2ส่วนที่3:กลุ่มเป้าหมายและผู้มีส่วนได้ส่วนเสีย
        กรอกข้อมูลtab2ส่วนที่4:เป้าหมาย ผลลัพท์ และผลกระทบโครงการ
        กดปุ่มถัดไปเพื่อบันทึกข้อมูลTab2

        FOR    ${index}    IN RANGE    1
            เพิ่มtab3ข้อมูลแนวทางการดำเนินงาน
            เพิ่มชื่อกิจกรรมย่อยและวันที่เริ่ม-สิ้นสุด
            FOR    ${index}    IN RANGE    1
                ${budgetType}    ${paymentGruop}    ${paymentType}    ${amount}   ${explain}=    เพิ่มข้อมูลตามลิสต์ประเภทรายจ่าย   ${index}
                เลือกข้อมูลงบประมาณที่ใช้ในกิจกรรมย่อย   ${budgetType}    ${paymentGruop}    ${paymentType}    ${index}
                เพิ่มข้อมูลตามลิสต์ประเภทรายจ่าย    ${index}
                กดปุ่มเพิ่มข้อมูลงบประมาณ    
                เพิ่มจำนวนเงินและคำชี้แจง    ${index}    ${amount}    ${explain}
            END
            กดปุ่มบันทึกข้อมูลกิจกรรมย่อย
        END

        เลือกวิธีการดำเนินการ
        กดปุ่มถัดไปเพื่อบันทึกข้อมูลtab3

        กรอกข้อมูลtab4ส่วนที่1:ข้อมูลทั่วไปของโครงการ
        กรอกข้อมูลtab4ส่วนที่2:ความพร้อมของโครงการ
        กรอกข้อมูลtab4ส่วนที่3:วิธีการบริหารจัดการเมื่อโครงการแล้วเสร็จ
        กดปุ่มถัดไปเพื่อบันทึกข้อมูลtab4

        Run Keyword If    '${expense_type}' == 'รายจ่ายประจำ'    กรอกข้อมูลส่วนที่ 5 ประเภทรายจ่ายประจำ
        ...    ELSE IF    '${expense_type}' == 'รายจ่ายลงทุน'    กรอกข้อมูลส่วนที่ 5 ประเภทรายจ่ายลงทุน

        Run Keyword If    '${action}' == 'draft'    กดปุ่มบันทึกข้อมูลสถานะบันทึกร่าง
        ...    ELSE IF    '${action}' == 'confirm'    กดปุ่มยืนยันข้อมูล

    END
    #Verify Save Success

ส่วนราชการยืนยันข้อมูล
    # เรียกทำ TC003 และ TC004 ผ่าน Keyword ซ้ำ 
    กรอกข้อมูลแบบคำขอตามประเภทและการยืนยัน    รายจ่ายประจำ    confirm
    กรอกข้อมูลแบบคำขอตามประเภทและการยืนยัน    รายจ่ายลงทุน    confirm

ล็อกอินเจ้าหน้าที่จังหวัด
    ล็อคอินถูกต้อง    ${PRO_USERNAME}    ${PRO_PASSWORD}

เจ้าหน้าที่จังหวัดพิจารณาคำขอ
    [Arguments]    ${action}
    ส่วนราชการยืนยันข้อมูล
    ล็อกอินเจ้าหน้าที่จังหวัด
    จังหวัดเข้าเมนูแบบคำขอ
    เลือกช่องทั้งหมด
    Run Keyword If    '${action}' == 'ยืนยัน'         กดปุ่มจังหวัดยืนยัน
    ...               ELSE IF    '${action}' == 'ส่งกลับแก้ไข'    กดปุ่มส่งกลับแก้ไข
    ...               ELSE    Fail    Invalid action: ${action}
ล็อกอินกบจ
    ล็อคอินถูกต้อง    ${PROAPP_USERNAME}    ${PROAPP_PASSWORD}

กบจพิจารณาแบบคำขอตามสถานะ
    [Arguments]    ${action}
    ส่วนราชการยืนยันข้อมูล
    ล็อกอินกบจ
    กบจเข้าเมนูแบบคำขอ
    เลือกช่องทั้งหมด
    Run Keyword If    '${action}' == 'เห็นชอบ'           กดปุ่มเห็นชอบ
    ...               ELSE IF    '${action}' == 'ไม่เห็นชอบ'    กดปุ่มไม่เห็นชอบ
    ...               ELSE IF    '${action}' == 'ส่งกลับจังหวัดแก้ไข'    กดปุ่มส่งกลับจังหวัดแก้ไข
    ...               ELSE IF    '${action}' == 'ส่งกลับส่วนราชการแก้ไข'    กดปุ่มส่งกลับส่วนราชการแก้ไข
    ...               ELSE    Fail    Invalid action: ${action}

*** Test Cases ***

TC001 : ส่วนราชการบันทึกข้อมูลแบบคำขอ ประเภทรายจ่ายประจำ - บันทึกร่าง
    [Documentation]    ทดสอบกรอกข้อมูลคำขอ รายจ่ายประจำ และกดบันทึกร่าง
    [Tags]    ส่วนราชการบันทึกแบบคำขอ
    กรอกข้อมูลแบบคำขอตามประเภทและการบันทึก    รายจ่ายประจำ    draft

TC002 : ส่วนราชการบันทึกข้อมูลแบบคำขอ ประเภทรายจ่ายลงทุน - บันทึกร่าง
    [Documentation]    ทดสอบกรอกข้อมูลคำขอ รายจ่ายลงทุน และกดบันทึกร่าง
    [Tags]    ส่วนราชการบันทึกแบบคำขอ
    กรอกข้อมูลแบบคำขอตามประเภทและการบันทึก    รายจ่ายลงทุน    draft

TC003 : ส่วนราชการบันทึกข้อมูลแบบคำขอ ประเภทรายจ่ายประจำ - ยืนยันข้อมูล
    [Documentation]    ทดสอบกรอกข้อมูลคำขอ รายจ่ายประจำ และกดยืนยันข้อมูล
    [Tags]    ส่วนราชการยืนยันข้อมูลแบบคำขอ
    กรอกข้อมูลแบบคำขอตามประเภทและการยืนยัน    รายจ่ายประจำ    confirm

TC004 : ส่วนราชการบันทึกข้อมูลแบบคำขอ ประเภทรายจ่ายลงทุน - ยืนยันข้อมูล
    [Documentation]    ทดสอบกรอกข้อมูลคำขอ รายจ่ายลงทุน และกดยืนยันข้อมูล
    [Tags]    ส่วนราชการยืนยันข้อมูลแบบคำขอ
    กรอกข้อมูลแบบคำขอตามประเภทและการยืนยัน   รายจ่ายลงทุน    confirm

TC005 : เจ้าหน้าที่จังหวัดยืนยันข้อมูล
    [Documentation]    เจ้าหน้าที่จังหวัดยืนยันข้อมูล
    [Tags]    จังหวัดพิจารณาคำขอ
    เจ้าหน้าที่จังหวัดพิจารณาคำขอ    ยืนยัน

TC006 : เจ้าหน้าที่จังหวัดส่งกลับแก้ไข
    [Documentation]    เจ้าหน้าที่จังหวัดส่งกลับแก้ไข
    [Tags]    จังหวัดพิจารณาคำขอ
    เจ้าหน้าที่จังหวัดพิจารณาคำขอ    ส่งกลับแก้ไข

TC007 : กบจ เห็นชอบแบบคำขอ
    [Documentation]    กบจ พิจารณาแบบคำขอเป็น เห็นชอบ
    [Tags]    กบจพิจารณาคำขอ
    กบจพิจารณาแบบคำขอตามสถานะ    เห็นชอบ

TC008 : กบจ ไม่เห็นชอบแบบคำขอ
    [Documentation]    กบจ พิจารณาแบบคำขอเป็น ไม่เห็นชอบ
    [Tags]    กบจพิจารณาคำขอ
    กบจพิจารณาแบบคำขอตามสถานะ    ไม่เห็นชอบ

TC008 : กบจ ส่งกลับจังหวัดแก้ไข
    [Documentation]    กบจ พิจารณาแบบคำขอเป็น ส่งกลับจังหวัดแก้ไข
    [Tags]    กบจพิจารณาคำขอ
    กบจพิจารณาแบบคำขอตามสถานะ    ส่งกลับจังหวัดแก้ไข

TC009 : กบจ ส่งกลับส่วนราชการแก้ไข
    [Documentation]    กบจ พิจารณาแบบคำขอเป็น ส่งกลับส่วนราชการแก้ไข
    [Tags]    กบจพิจารณาคำขอ
    กบจพิจารณาแบบคำขอตามสถานะ    ส่งกลับส่วนราชการแก้ไข
