*** Variables ***
${VALID_USERNAME}    org076
${VALID_PASSWORD}    org076
${INVALID_USERNAME}  invalid_user
${INVALID_PASSWORD}  invalid_pass

#data login role ORGPROV สำนักงานจังหวัด
${ORGPROV_USERNAME}    org020
${ORGPROV_PASSWORD}    org020

${ORGPROV_USERNAME1}    org020-1
${ORGPROV_PASSWORD1}    org020-1

${ORGPROV_USERNAME2}    Org020-2
${ORGPROV_PASSWORD2}    Org020-2

#data login role PRO จังหวัด
${PRO_USERNAME}    Aom_PROV20_1
${PRO_PASSWORD}    Aom#1150

#data login role GPRO กลุุ่มจังหวัด
${GPRO_USERNAME}    gprov020
${GPRO_PASSWORD}    gprov020

#data login role PROAPP กบจ
${PROAPP_USERNAME}    
${PROAPP_PASSWORD}

#ชื่อกิจกรรมหลัก
@{ACTIVITY_NAMES}   พัฒนาโครงสร้างพื้นฐาน   ส่งเสริมการศึกษา    พัฒนาสาธารณสุข   พัฒนาการศึกษา    พัฒนาชุมชน    ปรับปรุงการท่องเที่ยว
#ผู้รับผิดชอบ
@{RESPONSEPERSON}   สมชาย ใจดี    มานะ จริงใจ    สมศรี ดีใจ    มานี ปิติ    เป็นหญิง รักดี
#หลักการและเหตุผล
${reason}    (1.1.1) ยุทธศาสตร์ชาติ 20 ปี ด้านการสร้างความสามารถในการแข่งขัน ข้อ 
...    4.1 การเกษตรสร้างมูลค่าประเทศไทยเป็นหนึ่งในผู้เล่นสำคัญด้านการผลิตและการค้าสินค้าเกษตรในเวทีโลกด้วยพื้นฐานทางพีชเกษตรเขตร้อน 
...    และมีข้อได้เปรียบด้านความหลากหลายทางชีวภาพที่สามารถพัฒนาต่อยอดการเกษตรด้วยเทคโนโลยีและนวัตกรรม 
...    ที่ให้ความสำคัญกับการเพิ่มผลิตภาพการผลิตทั้งเชิงปริมาณและมูลค่าและความหลากหลายของสินค้าเกษตร เพื่อรักษาฐานรายได้เดิม 
...    และสร้างฐานอนาคตใหม่ที่สร้างรายได้สูงทั้งเกษตร อัตลักษณ์พื้นถิ่นเกษตรปลอดภัย เกษตรชีวภาพ เกษตรแปรรูป 
...    และเกษตรอัจฉริยะ เพื่อให้เกษตรกรมีรายได้สูงขึ้น
...    (1.1.2) แผนแม่บท ประเด็นการเกษตร มุ่งเน้นการยกระดับการผลิตให้เข้าสู่คุณภาพมาตรฐานความปลอดภัย 
...    การใช้ประโยชน์จากความโดดเด่นและเอกลักษณ์ของสินค้าเกษตร รวมถึงความหลากหลายทางชีวภาพในแต่ละพื้นที่ 
...    การพัฒนาสินค้าเกษตรและการแปรรูปสินค้าเกษตร เพื่อสร้างมูลค่าและคุณค่าให้กับสินค้าเกษตร 
...    การประยุกต์ใช้เทคโนโลยีและนวัตกรรมสมัยใหม่ในการผลิตและการจัดการฟาร์ม 
...    นอกจากนี้ยังมีการสนับสนุนและส่งเสริมการพัฒนาระบบนิเวศของภาคเกษตร 
...    เพื่อเสริมสร้างให้การพัฒนามีการเติบโตอย่างต่อเนื่องและเข้มแข็ง ในช่วงระยะเวลาของการพัฒนาเพื่อบรรลุเป้าหมายของยุทธศาสตร์ชาติ
...    (1.1.3) แผนพัฒนาเศรษฐกิจและสังคมแห่งชาติฉบับที่ 13 
...    ยุทธศาสตร์ที่ 3 : การสร้างความเข้มแข็งทางเศรษฐกิจ และการแข่งขันได้อย่างยั่งยืน
...    (1.1.4) เป้าหมายและแนวทางการพัฒนาภาคกลาง แนวทางพัฒนาที่ (1) ส่งเสริมการประยุกต์ใช้เทคโนโลยี นวัตกรรมและคลังข้อมูลการเกษตร 
...    ในการวางแผนพัฒนาผลผลิตและประสิทธิภาพการผลิตสินค้าเกษตรและเกษตรแปรรูปที่สอดคล้องกับศักยภาพของพื้นที่และความต้องการของตลาดที่
...    เปลี่ยนแปลงไปเพื่อพัฒนาผลิตภัณฑ์ใหม่ ๆ ที่สอดคล้องกับความต้องการของตลาด อาทิ อุตสาหกรรมอาหารเพื่อสุขภาพและอุตสาหกรรมสมุนไพร 
...    และเพื่อประกอบการวางแผน การดำเนินกิจกรรมทางการเกษตรในพื้นที่ที่ไม่เหมาะสมไปสู่การผลิตและแปรรูปสินค้าเกษตรที่มีมูลค่าเพิ่มสูง 
...    แนวทางพัฒนาที่ (3) ส่งเสริมการบริโภคสินค้าเกษตรและสินค้าเกษตรแปรรูปที่ได้คุณภาพ ด้วยการรณรงค์และส่งเสริมให้ผู้บริโภคมีความตระหนักเลือกใช้และบริโภค 
...    สินค้าเกษตรและเกษตรแปรรูปที่ปลอดภัย มีคุณภาพสูงและได้มาตรฐานเพื่อกระตุ้นให้เกิดตลาดสินค้าคุณภาพในวงกว้างอย่างทั่วถึง ซึ่งจะเป็นแรงผลักดันสำคัญที่จะนำไปสู่การปรับเปลี่ยนรูปแบบ 
...    วิธีการผลิตสินค้าเกษตรที่คำนึงถึงความปลอดภัยต่อผู้บริโภคและสิ่งแวดล้อม ซึ่งท้ายที่สุดจะส่งผลให้เกิดการขยายผลเพื่อพัฒนาคุณภาพการทำการเกษตรไปสู่มาตรฐานความปลอดภัยในระดับสากลต่อไป
#ปัญหา
${problem}    1.2.1 ศักยภาพ จังหวัดชลบุรี เป็นแหล่งผลิตสินค้าทางการเกษตรที่หลากหลาย มีพื้นที่เพาะปลูกมากที่สุด คือ ข้าว พื้นที่ 275,113 ไร่ 
...    ได้ผลผลิตปีละกว่า 270,000 ตัน คิดเป็นมูลค่าประมาณ 1,400 ล้านบาท มีจำนวนเกษตรกรผู้ปลูกข้าว ทั้งหมด 19,653 ราย เกษตรกรที่มีศักยภาพ 
...    และสนใจในระบบการผลิต GAP ประมาณร้อยละ 20 หรือ 3,930 ราย มีเกษตรกรได้ GAP แล้ว 213 ราย นอกจากนี้ยังมีสินค้าเกษตรที่สร้างรายได้
...    เกษตรกรที่มีศักยภาพ และสนใจในระบบการผลิต GAP ประมาณร้อยละ 20 หรือ 376 ราย มีเกษตรกรได้ GAP แล้ว 87 ราย 
...    ปลูกมากในอำเภอท่ายางและบ้านลาด ในส่วนของมะนาวพื้นที่การปลูก จำนวน 39,764.13 ไร่เกษตรกร 7,418 ครัวเรือน 
...    พื้นที่เก็บเกี่ยว 33,877.13 ไร่ ผลผลิตเฉลี่ย 2.02 ตัน ต่อไร่ ปลูกมากในอำเภอท่ายางแก่งกระจาน บ้านลาด และหนองหญ้าปล้อง
...    1.2.2 ปัญหา เกษตรกรยังขาดความรู้ความเข้าใจในขั้นตอนการปลูก การดูแลรักษาที่ถูกต้อง เช่นการตัดแต่งผล-ไว้ผล-การโยงผล-การตัดเก็บเกี่ยวผลทุเรียน 
...    การป้องกันกำจัดโรคแมลง การควบคุมทรงพุ่มในทุเรียน เป็นต้น อีกทั้ง เกษตรกรผู้ปลูกไม้ผลส่วนใหญ่ยังไม่ได้เข้าสู่กระบวนการผลิตสินค้าเกษตรปลอดภัย
...    พบปัญหาโรคและแมลงศัตรูพืช การจัดการดินและปุ่ย เทคนิคการเพิ่มประสิทธิภาพผลผลิต รวมไปถึงต้นทุนค่า ดูแลบำรุงรักษาที่เพิ่มมากขึ้น
...    1.2.3 ความต้องการ เพื่อเพิ่มศักยภาพการผลิตสินค้าเกษตรปลอดภัยไม้ผล และข้าวให้ได้คุณภาพ 
...    จึงควรมีการส่งเสริมให้ความรู้หลักแนวทางปฏิบัติ GAP การป้องกันกำจัดโรคและแมลง การจัดการปุ๋ย 
...    พัฒนาคุณภาพผลผลิตให้ตรงตามเกณฑ์มาตรฐานที่คู่ค้ากำหนด เพิ่มปริมาณผลผลิตต่อพื้นที่ ให้สอดคล้องตรง กับความต้องการของตลาด
...    1.2.4 แนวโน้ม/โอกาส แนวโน้มของผู้บริโภคมีความต้องการทั้งในและต่างประเทศ ทั้งในรูปของผลผลิตสินค้าเกษตรปลอดภัย 
...    และผลิตภัณฑ์สินค้าเกษตรแปรรูป ซึ่งสามารถจำหน่ายได้ตลอดทั้งปี
...    1.2.5 ภัยคุกคาม การเปลี่ยนแปลงสภาพภูมิอากาศทำให้ผลผลิตลดลง และมีผลทำให้เกิดโรค/แมลง ศัตรูพีชระบาด 
...    รวมถึงการเปลี่ยนแปลงของสังคมเกษตรกรรมไปเป็นสังคมเมืองมากขึ้น ทำให้พื้นที่การเกษตรลดลง 
...    1.2.6 เป้าหมาย รายได้ของเกษตรกรที่เพิ่มขึ้น จากมูลค่าผลผลิตทางการเกษตรที่เพิ่มสูงขึ้น
...    1.2.7 แนวทางการพัฒนา ตามยุทธศาสตร์ และประเด็นการพัฒนาของจังหวัดเพชรบุรี การพัฒนาเศรษฐกิจแบบครบวงจรจากฐานการเกษตร
...    การอุตสาหกรรม การบริการสู่ความมั่งคั่ง ยั่งยืน ด้วยนวัตกรรมและเทคโนโลยี แนวทางการพัฒนา สนับสนุนการพัฒนาการเกษตรปลอดภัย 
...    เกษตรอัจฉริยะ และเกษตร อุตสาหกรรมก้าวหน้าแบบครบวงจร รวมถึงสภาพปัญหา ความต้องการดังกล่าวข้างต้น 
...    สำนักงานเกษตรจังหวัดเพชรบุรีเป็นหน่วยงานหลักในการขับเคลื่อนการดำเนินงาน เพื่อพัฒนาศักยภาพการผลิตสินค้าเกษตร
...    ที่เปรียบเสมือนต้นน้ำที่มีความสำคัญในการก่อกำเนิดสินค้าเกษตรคุณภาพและเป็นการแก้ไขปัญหาการผลิตจาก ต้นทางอย่างแท้จริง 
...    โดยมีเป้าประสงค์คือคนไทยต้องได้รับประทานสินค้าคุณภาพดีเสมือนส่งไปขาย ต่างประเทศ และลดปัญหาราคาตกต่ำในช่วงฤดูกาลผลิตที่มีสินค้าออก
...    เป็นจำนวนมาก และมุ่งเน้นให้ผู้บริโภคมีความปลอดภัยได้บริโภคอาหารที่มีคุณภาพตามมาตรฐานความปลอดภัยด้านอาหาร 
...    ซึ่งทุกประเทศได้กำหนดมาตรฐานและกฎระเบียบด้านอาหารปลอดภัยเพื่อปกป้องชีวิตและสุขภาพของผู้บริโภคโดยอ้างอิงจากมาตรการ 
...    ด้านสุขอนามัยและสุขอนามัยพืช (Sanitary and Phytosanitary Measures : SPs) 
...    เพื่อควบคุมสินค้าเกษตรและอาหารให้ปลอดภัยจากการปนเปื้อนของสารเคมี จุลินทรีย์ และศัตรูพืช 
...    ซึ่งทำให้ความปลอดภัยด้านอาหารถูกนำมาเป็นเงื่อนไขในทางการค้ามากขึ้น จึงกำหนดแนวทางการพัฒนาสินค้าเกษตรที่สำคัญของจังหวัดให้มีคุณภาพสูง 
...    โดยการจัดทำโครงการเพิ่มประสิทธิภาพการผลิตไม้ผล ข้าว และสินค้าเกษตรแปรรูป ให้ได้มาตรฐานสอดคล้องกับความต้องการของตลาดทั้งในและต่างประเทศ 
...    เป็นการสร้างรายได้ให้เกษตรกรเพิ่มขึ้น จากมูลค่าผลผลิตทางการเกษตรที่เพิ่มสูงขึ้น
#ความเร่งด่วน
${urgency}    (1.3) ความเร่งด่วน : ด่วนมาก : จากเหตุผลและความจำเป็นดังกล่าว 
...    สำนักงานเกษตรจังหวัดชลบุรีซึ่งเป็นหน่วยงานที่มีภารกิจในการส่งเสริมและพัฒนาให้เกษตรกรมีความรู้ทักษะและความชำนาญ
...    ในการเพิ่มประสิทธิภาพการผลิตสินค้าเกษตรให้มีคุณภาพดี จึงมีความจำเป็นที่จะต้องพัฒนาเกษตรกรให้สามารถผลิต สินค้าเกษตรที่มีคุณภาพ
...     มีความปลอดภัยและได้มาตรฐาน ในขณะเดียวกันก็สามารถขยายฐานการส่งออกออกสู่ตลาดต่างประเทศได้ตลอดทั้งปี 
...    รวมถึงการส่งเสริมการแปรรูปสินค้าเกษตรเพื่อลดปัญหา ลดกระทบจากสินค้าเกษตรล้นตลาด 
...    ดังนั้น จึงได้จัดทำโครงการเพิ่มประสิทธิภาพการผลิตไม้ผล ข้าว และสินค้าเกษตรแปรรูปให้ได้มาตรฐานสอดคล้องกับความต้องการของตลาด
...    ทั้งในและต่างประเทศ ทั้งนี้ เพื่อให้เกิดการพัฒนาการผลิตอย่างยั่งยืน และเกษตรกรได้เล็งเห็นความสำคัญของการเพิ่มมูลค่าสินค้าเกษตรต่อไป
#วัตถุประสงค์ของโครงการ
${projectObjective}    1. เพื่อพัฒนาเกษตรกรผู้ผลิตผลไม้ ข้าวและสินค้าแปรรูปให้สามารถเพิ่มปริมาณและคุณภาพ
...    และมีมาตรฐานสอดคล้องกับความต้องการของตลาด โดยใช้ต้นทุนการผลิตที่เหมาะสม
...    2. เพื่อสร้างความเข้มแข็งให้กับกลุ่มเกษตรกร สามารถจัดตั้ง ดูแล บริหารกลุ่มได้ด้วยตนเองอย่างเป็นระบบ
#กลุ่มเป้าหมาย 
${targetGroup}    1. เกษตรกรผู้ปลูกไม้ผล ในจังหวัดชลบุรีที่รวมตัวเป็นกลุ่มผู้ผลิตไม้ผลคุณภาพ - ทุเรียน มะนาว 
...    จำนวน 5 กลุ่ม ๆ ละ 30 ราย รวมทั้งสิ้น 150 ราย - กล้วยหอม จำนวน 4 กลุ่ม ๆ ละ 25 ราย รวมทั้งสิ้น 100 ราย 
...    2. เกษตรกรผู้ปลูกข้าว จำนวน 10 กลุ่ม ๆ ละ 20 ราย รวมทั้งสิ้น 200 ราย 
...    3. กลุ่มแปรรูปผลผลิตการเกษตรโดยคัดเลือกกลุ่มแม่บ้านเกษตรกร/วิสาหกิจชุมชนที่มีความสนใจ
...    และมีศักยภาพทางด้านการแปรรูปผลผลิตทางการเกษตร จำนวน 5 กลุ่ม สมาชิกกลุ่มละ 15 ราย รวมทั้งสิน 75 ราย
#ผู้มีส่วนได้ส่วนเสีย
${stakeHolder}     ผู้ประกอบการ/ผู้ค้า/ผู้ส่งออก/เกษตรกรและผู้บริโภคทั้งในและต่างประเทศ
#เป้าหมาย
${indicator}    1. จำนวนแปลงสาธิตเทคโนโลยีการผลิตมะนาว/ทุเรียนคุณภาพดี รวม 5 แปลง
...    2. จำนวนแปลงเรียนรู้เทคโนโลยีการผลิตข้าวคุณภาพดี รวม 10 แปลง
...    3. เกษตรกรผู้ผลิตข้าว ไม้ผล และกลุ่มแปรรูป ร้อยละ 70 ที่เข้าร่วมโครงการ นำไปใช้ประโยชน์ในการผลิตและการแปรรูป
...    4. งานส่งเสริมการตลาดและการประชาสัมพันธ์สินค้าเกษตรคุณภาพ ปลอดภัย ได้มาตรฐานมีผู้เข้าร่วมงานอย่างน้อย 500 คน
#ผลผลิต
${product}    1. เกษตรกรผู้ปลูกไม้ผล (ทุเรียน มะนาว) จำนวน 5 กลุ่ม ๆ ละ 30 ราย ได้รับการถ่ายทอดความรู้ด้านการเพิ่มประสิทธิภาพการผลิต และนำความรู้ที่ได้รับไปปฏิบัติได้อย่างถูกต้องและเหมาะสม
...    2. แปลงสาธิตการผลิตไม้ผลคุณภาพ ทุเรียน มะนาว) กระจายอยู่ในพื้นที่และเจ้าของแปลงสามารถเป็นวิทยากรให้ความรู้แก่ผู้สนใจจำนวน 5 แปลง
...    3. เกษตรกผู้ปลูกข้าว ในพื้นที่จังหวัดเพชรบุรี จำนวน 10 กลุ่ม ๆ ละ 20 ราย ได้รับการถ่ายทอดความรู้ด้านการเพิ่มประสิทธิภาพการผลิต และนำความรู้ที่ได้รับไปปฏิบัติได้อย่างถูกต้องและเหมาะสม
...    4. แปลงเรียนรู้การผลิตข้าวคุณภาพดี กระจายอยู่ในพื้นที่และเจ้าของแปลงสามารถเป็นวิทยากรให้ความรู้แก่ผู้สนใจจำนวน 10 แปลง
...    5. เกษตรกรผู้ปลูกกล้วยหอม ในพื้นที่อำเภอท่ายาง บ้านลาด แก่งกระจาน และหนองหญ้าปล้องจำนวน 4 กลุ่ม ๆ ละ 25 ราย ได้รับการพัฒนาสู่ระบบมาตรฐาน GAP
...    6. กลุ่มแปรรูปผลผลิตการเกษตร ในพื้นที่จังหวัดเพชรบุรี จำนวน 5 กลุ่ม ๆ ละ 15 รายได้รับการพัฒนาความรู้ และสามารถสร้างสร้างมูลค่าเพิ่มให้กับผลผลิตทางการเกษตรโดยการแปรรูป
#ผลลัพธ์
${projectResult}    1. การรวมกลุ่มพัฒนาคุณภาพไม้ผลและเชื่อมโยงถึงกันและกันในแต่ละกลุ่มนำไปสู่การพัฒนาการผลิตและการตลาดของชุมชนในภาพรวม
...    2. การถ่ายทอดเทคโนโลยีการผลิตไม้ผลตามระบบการจัดการคุณภาพ GAP ส่งผลให้เกษตรกรได้นำเทคโนโลยีไปปรับใช้อย่างถูกต้องและเหมาะสม ทำให้ช่วยลดต้นทุนการผลิต มีปริมาณผลผลิตคุณภาพดีสูงขึ้น
...    3. เกษตรกรผู้ปลูกข้าว ในพื้นที่จังหวัดเพชรบุรีมีการใช้สารชีวภัณฑ์และแมลงศัตรูธรรมชาติทดแทนการใช้สารเคมี
...    4. กลุ่มมีความเข้มแข็งทั้งด้านการจัดการการผลิตและการตลาดรวมทั้งพัฒนาเครือข่ายของกลุ่มๆในระดับตำบล-อำเภอ-จังหวัด
#ผลกระทบเชิงบวก
${positiveImpact}    1. เกษตรกรชาวสวนสามารถผลิตสินค้าเกษตรคุณภาพดีตามมาตรฐานการส่งออกได้ไม่น้อยกว่าร้อยละ 80 ของผลผลิตที่ออกจากสวน
...    2. สร้างและกระจายรายได้ให้กับประชาชนในพื้นที่ ช่วยเสริมสร้างเศรษฐกิจของจังหวัดให้เติบโตอย่างมั่นคง
#ผลกระทบเชิงบลบ
${negativeImpact}    ไม่มี
#กิจกรรมย่อย
@{subActivity}    สร้างมูลค่าเพิ่มให้กับผลผลิตการเกษตรโดยการแปรรูป    
...    จัดทำแปลงสาธิตเทคโนโลยีการผลิตไม้ผลคุณภาพ (ทุเรียน มะนาว)  
...    ปรับปรุงถนน    ปรับปรุงการท่องเที่ยว    บำรุงการศึกษา 
#เพิ่มข้อมูลงบ
#@{budgetTypes}    200000    300000    400000    600000    500000
#@{paymentGroups}    210000    310000    410000    610000    510000
#@{paymentTypes}    5210100    5310100    5410100    5610100    5510100
#@{amounts}    100000    100000    100000    100000    100000

#วิธีการบริหารจัดการหรือการดูแลบำรุงรักษา 
${maintain}    1. ติดตามอย่างต่อเนื่อง เพื่อให้กลุ่มมีการพัฒนาให้ได้มาตรฐาน มีประสิทธิภาพ และยั่งยืน ส่งเสริมให้เกษตรกรมีการรวมกลุ่มเพื่อรับการถ่ายทอดความรู้ และมีการแลกเปลี่ยนเรียนรู้ระหว่างกันของเกษตรกร
...    2. องค์กรปกครองส่วนท้องถิ่น ร่วมรับรู้ รับทราบ ทำความเข้าใจขั้นตอนการดำเนินงาน วัตถุประสงค์เป้าหมายของโครงการ พร้อมทั้งร่วมรับทราบปัญหาที่เกิดขึ้นระหว่างการดำเนินงาน เพื่อให้เมื่อสิ้นสุดโครงการแล้วกลุ่มท่องเที่ยวเชิงเกษตรยังดำเนินกิจการอย่างต่อเนื่อง
...    3. สำนักงานพัฒนาชุมชน ให้ข้อแนะนำการพัฒนาผลิตภัณฑ์ชุมชน เพื่อให้นักท่องเที่ยวได้ใช้จ่ายซื้อเป็นของที่ระลึก หรืออุดหนุนสินค้าชุมชน เมื่อมาเที่ยวชมกลุ่ม ต่อยอดสร้างรายได้ให้ชุมชน
...    4. สำนักงานท่องเที่ยวและกีฬาจังหวัด ชมรมท่องเที่ยว ร่วมให้คำแนะนำ ข้อเสนอแนะ เพื่อให้กลุ่มเข้าใจความต้องการของนักท่องเที่ยว และพัฒนาแหล่งท่องเที่ยวให้ได้มาตรฐาน
${obstacle}    น้ำท่วม